[
{"pregunta": ["Getting \"'Emulation.setCPUThrottlingRate' wasn't found\" error on Mac and Windows os when trying to set this in the Protocol Monitor tab in chrome"], "descripcion": ["\n                I'm trying to simulate CPU throtling by puttin this command:\n{\"command\":\"Emulation.setCPUThrottlingRate\",\"parameters\":{\"rate\": 20}}\n\nIn the chrome dev tools ...\n            "]},
{"pregunta": ["MSBuild - Introducing PackageReference based on specific condition"], "descripcion": ["\n                The idea is to pull the referenced project as package if the active/current build configuration is not specified in BuildConfigurations metadata. Otherwise it will be added as ProjectReference. In ...\n            "]},
{"pregunta": ["Use Github copilot to review pull request through a Github workflow"], "descripcion": ["\n                I want to write a Github workflow that is triggered by pull requests and then use the Github copilot to review the pull request and provide suggestions preferably following predefined code guidelines.\n...\n            "]},
{"pregunta": ["PHPStorm: database host not accessible when in docker"], "descripcion": ["\n                Create simple Laravel application and up Laravel Sail.\nHere is how database service looks in Docker Desktop:\n\nThen try (unfortunately) to access this database host from PHPStorm Database Tools:\n\nAt ...\n            "]},
{"pregunta": ["Printing labels on Brother QL-800 printer from Excel VBA"], "descripcion": ["\n                I'm getting a \"Run-Time error 91:  Object variable or With block variable not set\" error when running this code to print from an Excel VBA application:\nPublic Sub PrintLabel(thisName, ...\n            "]},
{"pregunta": ["returns the objet html element of the radio button"], "descripcion": ["\n                I made a script to return an html element option object for a select but I would like to convert it for radio buttons with exactly the same parameters/data\npriceReplacer.forEach((pr) => {\n          ...\n            "]},
{"pregunta": ["Using Spring's @RequestMapping with multiple endpoints"], "descripcion": ["\n                @RequestMapping(value = { \"/abc/xyz/redirect\",\n            \"/abc/xyz/redirect/{refPath}\",\n            \"/abc/xyz/redirect/*\" })\npublic String handleRequest (ServletRequest ...\n            "]},
{"pregunta": ["TomTom Maps SDK integration issue: '/contact' page works fine but fails on reload"], "descripcion": ["\n                TomTom Maps SDK Integration Issue\nProblem Description\nIn our Nuxt.js application, we've integrated the TomTom Maps SDK to display a map on the '/contact' page. While the integration works fine ...\n            "]},
{"pregunta": ["Python typing with explicit hint not used"], "descripcion": ["\n                Why in the following code, a is not seen as being of type LineString? Pyright does not see any issue there with using a as an int.\nfrom typing import cast\n\nimport shapely\nfrom shapely.geometry....\n            "]},
{"pregunta": ["Find correlation coefficient between x and ax+by with known correlation coefficient between x and y"], "descripcion": ["\n                Suppose that there are two non-negative variables x and y. If the correlation coefficient between two variables x and y is positive, can we guarantee that the correlation coefficient between x and 0....\n            "]},
{"pregunta": ["How do I prevent my sprite from going behind the tilemap whilst patrolling?"], "descripcion": ["\n                Whenever I enter play mode, my patrolling enemy moves as expected but it's sprite is partially behind the tilemap. I can still interact with the game object. The Z position for my enemy is closer to ...\n            "]},
{"pregunta": ["What does packagingOptions -> pickFirst do?"], "descripcion": ["\n                In a ReactNative application, I can see inside the android/app/build.gradle the following section:\nandroid {\n...\n   packagingOptions {\n       pickFirst 'lib/x86/libc++_shared.so'\n       pickFirst 'lib/...\n            "]},
{"pregunta": ["Facing \"Did not find boundary character\" error when sending multipart form data from Java client to FastAPI server"], "descripcion": ["\n                I'm trying to upload a file and send a text parameter from my Java client to a Python FastAPI server. However, I'm encountering an error: Did not find boundary character 54 at index 4.\nI'm using a ...\n            "]},
{"pregunta": ["How to pass custom date range to clarity.ms"], "descripcion": ["\n                I need to pull data from clarity.ms using pyspark. When I referred documentation it is has option like numOfDays Instead do we have any option to filter on custom date range like startDate and EndDate\n...\n            "]},
{"pregunta": ["Cassandra java-driver Java 17 Compatibility"], "descripcion": ["\n                DataStax Java Driver 4.17 added Beta support for Java 17 per the Upgrade Guide docs.\nThis Apache Thread from November 2023 makes it look like Java Driver is now part of the Apache Software Foundation.\n...\n            "]},
{"pregunta": ["where to start learning how `import/exports` work in terms of node's codebase"], "descripcion": ["\n                After learning how require works by learning the source code of node.js, I became even more curious how the ESModule's import/exports work.\nWhere can I start learning the source code from ? which file ...\n            "]},
{"pregunta": ["My command always shows this, how do I fix it? python"], "descripcion": ["\n                def is_isogram(word):\n    clean_word = word.replace(\" \", \"\").lower()\n    \n    # space to store unique letters \n    unique_letters = set()\n    \n    # check if each letter appears ...\n            "]},
{"pregunta": ["After setting shrinkResources and minifyEnabled values true getting crash in android release build in SOA page http://flutter_inappwebview.in"], "descripcion": ["\n                Fatal Exception: java.lang.VerifyError: Verifier rejected class com.pichillilorenzo.flutter_inappwebview.in_app_webview.InAppWebViewClient: void com.pichillilorenzo.flutter_inappwebview.in_app_webview....\n            "]},
{"pregunta": ["Add callback function to tailwind \"duration\" animation"], "descripcion": ["\n                I am using Tailwind CSS. What I want to do is have a DIV fade in on the page, then when the fade is complete, immediately fade out again. This is what I have\n    <div class=\"duration-500 ...\n            "]},
{"pregunta": ["Consume a Laravel API endpoint using Fetch API - frontend"], "descripcion": ["\n                Assume I have the following Laravel endpoint  API resource which may be reached here:\ncurl --location 'http://userauthapi.local/api/login' \\\n--header 'Content-Type: application/json' \\\n--data-raw '{\n  ...\n            "]},
{"pregunta": ["Is it possible to remove checkboxes in a kendo grid but still have the row be selectable?"], "descripcion": ["\n                After remving checkboxes in a kendogrid, I am unable to select the rows. Is there a way to select a row by clicking anywhere on the row and not a checkbox? Can't seem to find doc for that.\nIf I ...\n            "]},
{"pregunta": ["React Leaflet Map Popup Re-rendering Problem"], "descripcion": ["\n                I have this code for Leaflet map where the popup content of markers is dynamically created for every unique profile ID.Markers are creating from data which arrives from WebSocket. However, each time ...\n            "]},
{"pregunta": ["SignInManager.IsSignedIn(User) is always false in _Layout.cshtml"], "descripcion": ["\n                I created a sample web application with Identity in order to manage authentication.\nBut currently I am facing an issue in _Layout.cshtml, SignInManager.IsSignedIn(User) is always false (even if the ...\n            "]},
{"pregunta": ["How to get the number of the row that contains a specific value in the given column?"], "descripcion": ["\n                I need to get the number of the row that contains a specific value in the given column. It is guaranteed that such value exists in the column and in a unique row.\nMy attempt:\nimport pandas as pd\npos = ...\n            "]},
{"pregunta": ["Wix: Error LGHT0091: Duplicate symbol 'Property:WIX_IS_NETFRAMEWORK_472_OR_LATER_INSTALLED' found"], "descripcion": ["\n                I've just started getting this error in Azure Devops pipelines using the MS hosted agent. I have made no code changes, it just started happening.\n\nError LGHT0091: Duplicate symbol 'Property:...\n            "]},
{"pregunta": ["Click event doesn't attach to button across multiple tabs"], "descripcion": ["\n                I have a Chrome Extension (manifest version 3) which adds a custom button to a few different ServiceTitan web pages and then attaches a click event handler to that button. This all works perfectly ...\n            "]},
{"pregunta": ["How write Django model query to get product list with product available in wishlist or not?"], "descripcion": ["\n                models.py\nmodels.py \nclass Product(models.Model):\n    code = models.CharField(max_length=50, default=None, null=True, blank=True, unique=True)\n    name = models.CharField(max_length=100)\n    ...\n            "]},
{"pregunta": ["How to listen to media session events of another app"], "descripcion": ["\n                I have created an app that can listen to headphones action using media sessions and perform custom actions but when another music player platform like spotify or default music player is used media ...\n            "]},
{"pregunta": ["How create a list with only the months that have complete days in Python"], "descripcion": ["\n                Consider the following DateTimeIndex:\nfrom calendar import monthrange\nimport pandas as pd\n\nindex_h = pd.date_range(start='2022-01-04 00:00:00', end='2023-01-10 23:00:00', freq='H')\n\nWe can see that ...\n            "]},
{"pregunta": ["HomeKit Accessory and services name(s)?"], "descripcion": ["\n                We are developing a Smart Home / IoT product that integrates into HomeKit. The integration is mostly done and interation with the product works great. We have only one problem: naming inside the home ...\n            "]},
{"pregunta": ["Why do different prometheus targets have different label names for the http_total_requests metric?"], "descripcion": ["\n                I'm setting up a grafana dashboard that uses the metric http_total_requests metric to get data. However, on some of the target services I have I get 2 different labels: status_code and code. Therefore,...\n            "]},
{"pregunta": ["How to use numbers in char in C++? [closed]"], "descripcion": ["\n                If char stores 1byte(8bits) values , it should be able to be used for numbers<100 . When I used it , it showed compiler error. (I'm new to programming , please pardon any mistake)\nI used a single ...\n            "]},
{"pregunta": ["Logout Functionality not working immediately after login"], "descripcion": ["\n                am developing an application for android and ios both. But I am unable to logout from the application when I logged in once then log out then again login. After this moment the logout functionality is ...\n            "]},
{"pregunta": ["Gutters GX and GY dont work for some reason in bootstrap, html/css"], "descripcion": ["\n                i tried to add gutters to my grid with bootstrap, but they do not appear. i dont know why they dont as im following the steps as noted on the bootstrap docs.\n<!DOCTYPE html>\n<html lang=\"...\n            "]},
{"pregunta": ["Postman Script: Only the Last Request is Getting Executed in a Loop, Why?"], "descripcion": ["\n                why this is happening only request at the last is only getting executed.\npre- request script:\nconst testCases = ['1002', '3002', '100002', 'singh', '1002y'];\n\n    // Set the productid variable for the ...\n            "]},
{"pregunta": ["Applying a function to all elements of a tree in Python"], "descripcion": ["\n                There is a tree-like data structure, the nodes of which contain scalar values (integers), lists and dictionaries, np.array.\nI need to write a function (in Python) that applies an aggregation function ...\n            "]},
{"pregunta": ["Text Embedding result based on Priority"], "descripcion": ["\n                I am new to OpenAI, I have integrated text-embedding-ada-002 modal in AWS OpenSearch for the semantic search.\nI want text Embedding Results based on my priority order so for example\nmy document is ...\n            "]},
{"pregunta": ["Generate new column based on RECORD_EFFECTIVE_FROM_DATE using pyspark"], "descripcion": ["\n                I have to use pyspark. Generate a new column called Record_effective_to_Date by shifting values from  Record_effective_From_Date. I tried lead, lag functions but it is not populating correct result ...\n            "]},
{"pregunta": ["Running other docker images in Jenkins Pipeline"], "descripcion": ["\n                I am having some issues running some Docker image via Jenkins job.\nA little bit about my system:\nI have a Virtual machine (Ubuntu) where the following services are running:\n\nDocker:\n\npatrikas@xxx-test:...\n            "]},
{"pregunta": ["How perform search by key contains in kafka-ui?"], "descripcion": ["\n                Documentation provide exmaples. But when I try to use keyAsText ~ \".*\" I got no results:\n\nHow to write correct regexp to search in kafka ui?\n            "]},
{"pregunta": ["Creating h1 tags for bilingual email"], "descripcion": ["\n                I need to create bilingual emails going out to clients, which will have the English content followed by the French below. The French is translated from the English so they both have titles set to h1. ...\n            "]},
{"pregunta": ["Gradle Build failed - Could not resolve spring dependencies"], "descripcion": ["\n                I'm facing below issue when I import Gradle project into STS workspace.\nBelow are the versions\nJava8, Gradle 7.1, Spring Boot 2.56\nFAILURE: Build failed with an exception.\n\n* What went wrong:\nA ...\n            "]},
{"pregunta": ["Unable to create project Prism.Maui Visual Studio 2022"], "descripcion": ["\n                Steps I'm following:\n\nOpen Visual Studio 2022 with no project\nInstall Prism.Templates::8.1.97 (dotnet new install Prism.Templates::8.1.97)\nFile > New > Project > Prism .NET App (Dan Siegel)\n...\n            "]},
{"pregunta": ["Flutter - how to prevent an app being closed by user on IpadPro (iPadOs 17)"], "descripcion": ["\n                I'm developing a tablet application for a cafe. The application is for commercial use only and will not be published on the app store. This is an application for the user to place an order, such as ...\n            "]},
{"pregunta": ["Content For Shopping API"], "descripcion": ["\n                In my Laravel project, I want to update the stock status of one of the products I added with Google Merchant Centre Content API using API.\nbut FeedId is requested, but I do not know where to get the ...\n            "]},
{"pregunta": ["Reduce Resolution of pdf in php"], "descripcion": ["\n                I'm receiving a PDF from an api, and the resolution is 429x643mm - I need a document that's 100 x 150 approx instead, which means I need to divide the length and height by about 4.24 or 4.25.\nI'm not ...\n            "]},
{"pregunta": ["How to validate XML using SCH (schematron) and XSD in Python?"], "descripcion": ["\n                I'm generating e-invoicing XML files (CII D16B) using Python. These files comply with the EN16931 standard (https://github.com/ConnectingEurope/eInvoicing-EN16931).\nI need to validate the generated ...\n            "]},
{"pregunta": ["\"./\" is not recognized as an internal or external command"], "descripcion": ["\n                I've just finished my MP for A programming course. In order to test it, I have to run a script that is already given by the course by typing ./<script_name>, and diff it with the correct output.\n...\n            "]},
{"pregunta": ["Extract info from kml polygon in google maps and use it to submit on html form"], "descripcion": ["\n                First, thanks.\nI'm creating a little app where i have a google map and use geoxml3 to parse kml files. At now, i load the map correcty and the kml file loads layer with its polygons and the ...\n            "]},
{"pregunta": ["Adding Column as child to Container in flutter is not working. How to solve it?"], "descripcion": ["\n                I have this code for contacts page which renders fine:\nimport 'package:flutter/material.dart';\n\nclass ContactsPage extends StatelessWidget {\n  const ContactsPage({super.key});\n\n  @override\n  Widget ...\n            "]}
]